## 重新发现PostgreSQL之美 - 28 旋转门   
          
### 作者          
digoal          
          
### 日期          
2021-06-17           
          
### 标签          
PostgreSQL , 压缩 , IOT , 旋转门           
          
----          
          
## 背景          
    
场景:        
物联网、金融、游戏、社交、电商等时序场景.  
        
挑战:        
数据量超大, 即使采用列存、数据压缩方式还是很大.  
        
PG 解决方案:      
有损压缩, 自定义旋转门算法.    
  
视频回放: https://www.bilibili.com/video/BV1Eg411g7Sx/  
  
## 参考  
##### 201801/20180107_01.md   [《SQL流式案例 - 旋转门压缩(前后计算相关滑窗处理例子)》](../201801/20180107_01.md)    
##### 201608/20160816_01.md   [《PostgreSQL 三角函数的用法举例 - 已知3点求任意夹角（旋转门续）》](../201608/20160816_01.md)    
##### 201608/20160813_01.md   [《旋转门数据压缩算法在PostgreSQL中的实现 - 流式压缩在物联网、监控、传感器等场景的应用》](../201608/20160813_01.md)    
  
