## 自主可控、安全可控 - 为什么选择开源数据库、如何选择、需要做哪些准备 
                                                                 
### 作者                                                                 
digoal                                                                 
                                                                 
### 日期                                                                 
2018-11-01                                                               
                                                                 
### 标签                                                                 
PostgreSQL , 开源产品 , 生态 , 人才梯队 , 自主可控          
                                                                 
----                                                                 
                                                                 
## 背景  
分析企业为什么要选择开源产品，如何选择开源产品，需要做哪些准备。

以数据库为例。

# 一、为什么选择开源数据库？

1、安全可控

2、自主可控

3、成本，随着业务架构变迁，微服务化改造等，数据库单体需求量越来越多，而传统的商用数据库计算许可

4、生态

5、发展趋势

6、国际形势

# 二、如何选择开源数据库？

## 1 开源数据库与商用数据库利弊

## 2 是否需要外部案例背书

例子

悖论



## 3 有哪些案例背书



## 4 自建与云的区别

## 5 自建与采购商业数据库的区别

## 6 开源数据库选型的考量因素

同类开源产品很多，如何选择？

目标，选择开源数据库解决什么问题？

技术

生态

趋势

技术栈

## 7 技术栈、人才问题


# 三、需要做哪些准备

## 1 推行开源数据库的阻力

## 2 推行开源数据库的驱动力

## 3 理清利益分配

## 4 如何打通关节


## 5 如何建设人才梯队


## 6 自建人才梯队的程度、难度
自建到什么程度

难度

## 7 是否需要外部兜底

## 8 谁可以兜底


## 9 数据库按重要程度的划分

## 10 开源数据库的推行落地方法

## 11 推陈出新

## 12 去商业数据库（比如O）节奏

ADAM







  
